SubscriberService/src/test/resources/exampleRequests/DeliverTMUTrafficDataRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header />
	<soapenv:Body>
		<d2lm:d2LogicalModel xmlns:d2lm="http://datex2.eu/schema/2/2_0"
			modelBaseVersion="2" extensionName="NTIS Published Services"
			extensionVersion="2.0">
			<d2lm:exchange>
				<d2lm:supplierIdentification>
					<d2lm:country>gb</d2lm:country>
					<d2lm:nationalIdentifier>NTIS</d2lm:nationalIdentifier>
				</d2lm:supplierIdentification>
			</d2lm:exchange>
			<d2lm:payloadPublication xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
				xsi:type="d2lm:MeasuredDataPublication" lang="en">
				<d2lm:feedType>TMU Loop Traffic Data</d2lm:feedType>
				<d2lm:publicationTime>2013-07-10T14:54:21.555+01:00</d2lm:publicationTime>
				<d2lm:publicationCreator>
					<d2lm:country>gb</d2lm:country>
					<d2lm:nationalIdentifier>NTIS</d2lm:nationalIdentifier>
				</d2lm:publicationCreator>
				<d2lm:measurementSiteTableReference
					targetClass="MeasurementSiteTable" version="56.0"
					id="NTIS_TMU_Measurement_Sites" />
				<d2lm:headerInformation>
					<d2lm:confidentiality>restrictedToAuthoritiesTrafficOperatorsAndPublishers</d2lm:confidentiality>
					<d2lm:informationStatus>real</d2lm:informationStatus>
					<d2lm:urgency>normalUrgency</d2lm:urgency>
				</d2lm:headerInformation>
				<d2lm:siteMeasurements>
					<d2lm:measurementSiteReference
						targetClass="MeasurementSiteRecord" version="56.0"
						id="C6E971CAD28D789BE0433CC411ACCCEA" />
					<d2lm:measurementTimeDefault>2012-04-12T11:01:00.000Z</d2lm:measurementTimeDefault>
					<d2lm:measuredValue index="0">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficSpeed">
								<d2lm:averageVehicleSpeed>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:speed>10.0</d2lm:speed>
								</d2lm:averageVehicleSpeed>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="1">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficHeadway">
								<d2lm:averageTimeHeadway>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:duration>15.0</d2lm:duration>
								</d2lm:averageTimeHeadway>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="2">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficConcentration">
								<d2lm:occupancy>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:percentage>16.0</d2lm:percentage>
								</d2lm:occupancy>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="3">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>660</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="4">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>true</d2lm:dataError>
									<d2lm:reasonForDataError>
										<d2lm:values>
											<d2lm:value>out of range</d2lm:value>
										</d2lm:values>
									</d2lm:reasonForDataError>
									<d2lm:vehicleFlowRate>720</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="5">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>780</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="6">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>840</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
				</d2lm:siteMeasurements>
				<d2lm:siteMeasurements>
					<d2lm:measurementSiteReference
						targetClass="MeasurementSiteRecord" version="56.0"
						id="C6E971CAD28D789BE0433CC411ACCCEA" />
					<d2lm:measurementTimeDefault>2012-04-12T11:02:00.000Z
					</d2lm:measurementTimeDefault>
					<d2lm:measuredValue index="0">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficSpeed">
								<d2lm:averageVehicleSpeed>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:speed>20.0</d2lm:speed>
								</d2lm:averageVehicleSpeed>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="1">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficHeadway">
								<d2lm:averageTimeHeadway>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:duration>25.0</d2lm:duration>
								</d2lm:averageTimeHeadway>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="2">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficConcentration">
								<d2lm:occupancy>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:percentage>26.0</d2lm:percentage>
								</d2lm:occupancy>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="3">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>1260</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="4">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>1320</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="5">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>1380</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="6">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>1440</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
				</d2lm:siteMeasurements>
				<d2lm:siteMeasurements>
					<d2lm:measurementSiteReference
						targetClass="MeasurementSiteRecord" version="56.0"
						id="C6E971CAD28D789BE0433CC411ACCCEA" />
					<d2lm:measurementTimeDefault>2012-04-12T11:03:00.000Z
					</d2lm:measurementTimeDefault>
					<d2lm:measuredValue index="0">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficSpeed">
								<d2lm:averageVehicleSpeed>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:speed>30.0</d2lm:speed>
								</d2lm:averageVehicleSpeed>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="1">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficHeadway">
								<d2lm:averageTimeHeadway>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:duration>35.0</d2lm:duration>
								</d2lm:averageTimeHeadway>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="2">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficConcentration">
								<d2lm:occupancy>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:percentage>36.0</d2lm:percentage>
								</d2lm:occupancy>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="3">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>1860</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="4">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>1920</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="5">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>1980</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="6">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>2040</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
				</d2lm:siteMeasurements>
				<d2lm:siteMeasurements>
					<d2lm:measurementSiteReference
						targetClass="MeasurementSiteRecord" version="56.0"
						id="C6E971CAD28D789BE0433CC411ACCCEA" />
					<d2lm:measurementTimeDefault>2012-04-12T11:04:00.000Z
					</d2lm:measurementTimeDefault>
					<d2lm:measuredValue index="0">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficSpeed">
								<d2lm:averageVehicleSpeed>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:speed>40.0</d2lm:speed>
								</d2lm:averageVehicleSpeed>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="1">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficHeadway">
								<d2lm:averageTimeHeadway>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:duration>45.0</d2lm:duration>
								</d2lm:averageTimeHeadway>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="2">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficConcentration">
								<d2lm:occupancy>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:percentage>46.0</d2lm:percentage>
								</d2lm:occupancy>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="3">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>2460</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="4">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>2520</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="5">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>2580</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
					<d2lm:measuredValue index="6">
						<d2lm:measuredValue>
							<d2lm:basicData xsi:type="d2lm:TrafficFlow">
								<d2lm:vehicleFlow>
									<d2lm:dataError>false</d2lm:dataError>
									<d2lm:vehicleFlowRate>2640</d2lm:vehicleFlowRate>
								</d2lm:vehicleFlow>
							</d2lm:basicData>
						</d2lm:measuredValue>
					</d2lm:measuredValue>
				</d2lm:siteMeasurements>
			</d2lm:payloadPublication>
		</d2lm:d2LogicalModel>
	</soapenv:Body>
</soapenv:Envelope>